{
  "home": {
    "title": "KanaDojo - Japanisch Hiragana, Katakana, Kanji und Vokabeln Online Lernen",
    "titleShort": "KanaDojo - Japanisch Lernen",
    "description": "Meistern Sie Japanisch mit KanaDojo - einer ästhetischen, minimalistischen Plattform zum Lernen von Hiragana, Katakana, Kanji und Vokabeln. Üben Sie mit interaktiven Spielen, verfolgen Sie Ihren Fortschritt und personalisieren Sie Ihre Lernerfahrung mit über 100 Themen.",
    "descriptionShort": "Meistern Sie japanische Hiragana, Katakana, Kanji und Vokabeln mit interaktiven Spielen, Fortschrittsverfolgung und schönen Anpassungsoptionen.",
    "keywords": "japanisch lernen, hiragana lernen, katakana lernen, kana lernen, kanji lernen, japanische vokabeln, hiragana übung, katakana übung, kanji übung, japanisch lern app, japanisch online kurs, japanisches schriftsystem, JLPT vorbereitung, japanisch sprachelernen, kana dojo, japanisch lernwerkzeug, kostenlose japanisch kurse"
  },
  "kana": {
    "title": "Kana Dojo - Japanische Hiragana und Katakana Nach Level Lernen",
    "titleShort": "Kana Dojo - Hiragana & Katakana",
    "description": "Meistern Sie Hiragana und Katakana mit interaktiven Spielen und Übungen. Üben Sie japanische Kana-Zeichen nach Schwierigkeitsgrad mit sofortigem Feedback und Fortschrittsverfolgung.",
    "keywords": "hiragana, katakana, japanische kana, hiragana lernen, katakana lernen, kana übung, japanisches alphabet"
  },
  "learnHiragana": {
    "title": "Hiragana Lernen - Komplette Tabelle, Übungen & Training | KanaDojo",
    "titleShort": "Hiragana Lernen",
    "description": "Lernen Sie Hiragana schnell mit interaktiven Übungen, auswählbaren Kana-Karten und geführter Praxis. Meistern Sie die komplette Hiragana-Tabelle, Dakuon und Yoon mit sofortigem Feedback.",
    "keywords": "hiragana lernen, hiragana tabelle, hiragana übung, hiragana quiz, hiragana karteikarten, hiragana aussprache, hiragana lesen, hiragana zeichen, hiragana dakuon, hiragana yoon, hiragana für anfänger"
  },
  "learnKatakana": {
    "title": "Katakana Lernen - Komplette Tabelle, Übungen & Training | KanaDojo",
    "titleShort": "Katakana Lernen",
    "description": "Lernen Sie Katakana schnell mit interaktiven Übungen, auswählbaren Kana-Karten und geführter Praxis. Meistern Sie die komplette Katakana-Tabelle, Dakuon, Yoon und Fremdlaute mit sofortigem Feedback.",
    "keywords": "katakana lernen, katakana tabelle, katakana übung, katakana quiz, katakana karteikarten, katakana aussprache, katakana lesen, katakana zeichen, katakana dakuon, katakana yoon, katakana fremdlaute"
  },
  "kanaBlitz": {
    "title": "Kana Blitz - Testen Sie Ihre Hiragana und Katakana Geschwindigkeit",
    "titleShort": "Kana Blitz",
    "description": "Testen Sie Ihre Geschwindigkeit bei der Erkennung japanischer Kana mit Kana Blitz. Fordern Sie sich mit zeitgesteuerten Übungen heraus und verfolgen Sie Ihren Fortschritt.",
    "keywords": "kana geschwindigkeitstest, hiragana geschwindigkeit, katakana geschwindigkeit, japanische kana übung, kana karteikarten, schnelles kana lesen, zeitgesteuertes kana quiz, schnelles hiragana abrufen, schnelle katakana erkennung, kana drill"
  },
  "kanaGauntlet": {
    "title": "Kana Gauntlet - Meistern Sie Jedes Zeichen",
    "titleShort": "Kana Gauntlet",
    "description": "Meistern Sie jedes Hiragana- und Katakana-Zeichen mit dem Kana Gauntlet. Umfassende Übung für alle japanischen Kana.",
    "keywords": "kana meisterschaft, hiragana meisterschaft, katakana meisterschaft, umfassende kana übung"
  },
  "kanji": {
    "title": "Kanji Dojo - Japanische Kanji-Zeichen Nach JLPT Level Lernen",
    "titleShort": "Kanji Dojo",
    "description": "Lernen Sie japanische Kanji-Zeichen organisiert nach JLPT-Levels. Üben Sie mit interaktiven Übungen, verfolgen Sie Ihren Fortschritt und meistern Sie Tausende von Kanji.",
    "keywords": "kanji, kanji lernen, japanische kanji, JLPT kanji, kanji übung, kanji nach level"
  },
  "kanjiJlptN5": {
    "title": "JLPT N5 Kanji - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N5 Kanji",
    "description": "Üben Sie JLPT N5 Kanji mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n5 kanji, n5 kanji, n5 kanji liste, n5 kanji übung, kanji lernen n5"
  },
  "kanjiJlptN4": {
    "title": "JLPT N4 Kanji - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N4 Kanji",
    "description": "Üben Sie JLPT N4 Kanji mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n4 kanji, n4 kanji, n4 kanji liste, n4 kanji übung, kanji lernen n4"
  },
  "kanjiJlptN3": {
    "title": "JLPT N3 Kanji - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N3 Kanji",
    "description": "Üben Sie JLPT N3 Kanji mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n3 kanji, n3 kanji, n3 kanji liste, n3 kanji übung, kanji lernen n3"
  },
  "kanjiJlptN2": {
    "title": "JLPT N2 Kanji - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N2 Kanji",
    "description": "Üben Sie JLPT N2 Kanji mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n2 kanji, n2 kanji, n2 kanji liste, n2 kanji übung, kanji lernen n2"
  },
  "kanjiJlptN1": {
    "title": "JLPT N1 Kanji - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N1 Kanji",
    "description": "Üben Sie JLPT N1 Kanji mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n1 kanji, n1 kanji, n1 kanji liste, n1 kanji übung, kanji lernen n1"
  },
  "kanjiBlitz": {
    "title": "Kanji Blitz - Testen Sie Ihre Kanji-Erkennungsgeschwindigkeit",
    "titleShort": "Kanji Blitz",
    "description": "Testen Sie Ihre Geschwindigkeit bei der Erkennung japanischer Kanji mit Kanji Blitz. Schnelle Übungen zur Verbesserung Ihrer Kanji-Fähigkeiten.",
    "keywords": "kanji geschwindigkeitstest, kanji erkennung, schnelle kanji übung, kanji karteikarten, kanji drill, schnelles kanji lesen, zeitgesteuertes kanji quiz, schnelles kanji abrufen, kanji schnelllesen, JLPT kanji übung"
  },
  "kanjiGauntlet": {
    "title": "Kanji Gauntlet - Meistern Sie Jedes Zeichen",
    "titleShort": "Kanji Gauntlet",
    "description": "Meistern Sie jedes Kanji-Zeichen mit dem Kanji Gauntlet. Umfassende Übung für alle JLPT-Levels.",
    "keywords": "kanji meisterschaft, umfassende kanji übung, alle JLPT kanji"
  },
  "vocabulary": {
    "title": "Vocabulary Dojo - Japanische Wörter und Vokabeln Nach JLPT Level Lernen",
    "titleShort": "Vocabulary Dojo",
    "description": "Erweitern Sie Ihren japanischen Wortschatz mit Wörtern organisiert nach JLPT-Levels. Interaktive Übungen, Beispielsätze und Fortschrittsverfolgung.",
    "keywords": "japanische vokabeln, japanische wörter lernen, JLPT vokabeln, vokabel übung, japanische wortliste, vokabel karteikarten, japanische phrasen, JLPT wort studium, vokabeln nach level, japanische vokabel app"
  },
  "vocabularyJlptN5": {
    "title": "JLPT N5 Vokabeln - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N5 Vokabeln",
    "description": "Üben Sie JLPT N5 Vokabeln mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n5 vokabeln, n5 wortliste, n5 vokabeln üben, japanisch n5 wörter"
  },
  "vocabularyJlptN4": {
    "title": "JLPT N4 Vokabeln - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N4 Vokabeln",
    "description": "Üben Sie JLPT N4 Vokabeln mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n4 vokabeln, n4 wortliste, n4 vokabeln üben, japanisch n4 wörter"
  },
  "vocabularyJlptN3": {
    "title": "JLPT N3 Vokabeln - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N3 Vokabeln",
    "description": "Üben Sie JLPT N3 Vokabeln mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n3 vokabeln, n3 wortliste, n3 vokabeln üben, japanisch n3 wörter"
  },
  "vocabularyJlptN2": {
    "title": "JLPT N2 Vokabeln - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N2 Vokabeln",
    "description": "Üben Sie JLPT N2 Vokabeln mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n2 vokabeln, n2 wortliste, n2 vokabeln üben, japanisch n2 wörter"
  },
  "vocabularyJlptN1": {
    "title": "JLPT N1 Vokabeln - Liste und Übung | KanaDojo",
    "titleShort": "JLPT N1 Vokabeln",
    "description": "Üben Sie JLPT N1 Vokabeln mit interaktiven Übungen, schneller Auswahl und Fortschrittsverfolgung.",
    "keywords": "jlpt n1 vokabeln, n1 wortliste, n1 vokabeln üben, japanisch n1 wörter"
  },
  "vocabularyBlitz": {
    "title": "Vocabulary Blitz - Testen Sie Ihre Japanische Vokabelgeschwindigkeit",
    "titleShort": "Vocabulary Blitz",
    "description": "Testen Sie Ihre japanische Vokabelgeschwindigkeit mit Vocabulary Blitz. Schnelle Worterkennungsübungen.",
    "keywords": "vokabel geschwindigkeitstest, japanische wörter, schnelle vokabel übung, vokabel karteikarten, wort drill, schnelles japanisch lesen, zeitgesteuertes vokabel quiz, schnelles wort abrufen, JLPT vokabel übung, japanische wort erkennung"
  },
  "vocabularyGauntlet": {
    "title": "Vocabulary Gauntlet - Meistern Sie Jedes Wort",
    "titleShort": "Vocabulary Gauntlet",
    "description": "Meistern Sie umfassenden japanischen Wortschatz mit dem Vocabulary Gauntlet. Üben Sie alle JLPT-Wörter.",
    "keywords": "vokabel meisterschaft, umfassender wortschatz, alle JLPT wörter"
  },
  "academy": {
    "title": "Akademie - Japanisch Lernartikel | KanaDojo",
    "titleShort": "Akademie",
    "description": "Lesen Sie umfassende Anleitungen und Artikel über das Japanischlernen. Tipps, Tricks und Einblicke zum Meistern von Hiragana, Katakana, Kanji und Vokabeln.",
    "keywords": "japanisch lernanleitungen, japanisch tipps, hiragana anleitung, katakana anleitung, kanji anleitung"
  },
  "preferences": {
    "title": "Einstellungen - Personalisieren Sie Ihre Lernerfahrung",
    "titleShort": "Einstellungen",
    "description": "Personalisieren Sie Ihre KanaDojo-Lernerfahrung. Wählen Sie Themen, Schriftarten und konfigurieren Sie Ihre Lernpräferenzen.",
    "keywords": "KanaDojo personalisieren, lernpräferenzen, themen, schriftarten"
  },
  "progress": {
    "title": "Fortschritt - Verfolgen Sie Ihre Japanisch Lernstatistiken",
    "titleShort": "Fortschritt",
    "description": "Verfolgen Sie Ihren Japanisch-Lernfortschritt. Sehen Sie detaillierte Statistiken, Errungenschaften und Lernmeilensteine.",
    "keywords": "lernfortschritt, japanisch statistiken, lernanalyse"
  },
  "privacy": {
    "title": "Datenschutzrichtlinie - Ihr Datenschutz bei KanaDojo",
    "titleShort": "Datenschutz",
    "description": "Erfahren Sie, wie KanaDojo Ihre Privatsphäre schützt und Ihre Daten verwaltet. Unser Engagement für Datenschutz und Datensicherheit.",
    "keywords": "datenschutzrichtlinie, datenschutz, benutzerprivatsphäre"
  },
  "terms": {
    "title": "Nutzungsbedingungen - KanaDojo Nutzungsrichtlinien",
    "titleShort": "Nutzungsbedingungen",
    "description": "Lesen Sie die Nutzungsbedingungen von KanaDojo. Richtlinien für die Nutzung unserer Japanisch-Lernplattform.",
    "keywords": "nutzungsbedingungen, nutzungsrichtlinien, allgemeine geschäftsbedingungen"
  },
  "security": {
    "title": "Sicherheitsrichtlinie - Wie Wir KanaDojo Sicher Halten",
    "titleShort": "Sicherheit",
    "description": "Erfahren Sie mehr über KanaDojos Sicherheitsmaßnahmen und wie wir unsere Plattform und Benutzer schützen.",
    "keywords": "sicherheitsrichtlinie, plattformsicherheit, datensicherheit"
  },
  "credits": {
    "title": "Danksagungen - Mitwirkende und Unterstützer",
    "titleShort": "Danksagungen",
    "description": "Treffen Sie die Mitwirkenden und Unterstützer, die KanaDojo möglich machen. Unsere Gemeinschaft von Entwicklern, Designern und Unterstützern.",
    "keywords": "danksagungen, mitwirkende, unterstützer, gemeinschaft"
  },
  "patchNotes": {
    "title": "Versionshinweise - Neueste Updates und Funktionen",
    "titleShort": "Versionshinweise",
    "description": "Bleiben Sie auf dem Laufenden über die neuesten KanaDojo-Funktionen, Verbesserungen und Fehlerbehebungen. Sehen Sie unser Änderungsprotokoll.",
    "keywords": "versionshinweise, updates, änderungsprotokoll, neue funktionen"
  },
  "experiments": {
    "title": "Experimente - Erkunden Sie Alternative Lernmethoden",
    "titleShort": "Experimente",
    "description": "Erkunden Sie experimentelle Funktionen und alternative Lernmethoden für Japanisch. Probieren Sie neue Übungsmöglichkeiten aus.",
    "keywords": "experimente, alternatives lernen, japanische übungsmethoden"
  },
  "translate": {
    "title": "Übersetzer - Japanisch-Deutsch Übersetzungswerkzeug",
    "titleShort": "Übersetzer",
    "description": "Übersetzen Sie zwischen Japanisch und Deutsch mit unserem integrierten Übersetzungstool. Perfekt zum Üben und Verstehen japanischer Texte.",
    "keywords": "japanisch übersetzer, übersetzungswerkzeug, japanisch deutsch"
  },
  "zen": {
    "title": "Zen-Modus - Ablenkungsfreie Japanisch-Übung",
    "titleShort": "Zen-Modus",
    "description": "Üben Sie Japanisch in einer ablenkungsfreien, minimalistischen Umgebung. Konzentrieren Sie sich auf Ihr Lernen mit dem Zen-Modus.",
    "keywords": "zen modus, fokussiertes üben, minimalistisches lernen, ablenkungsfrei"
  },
  "kanaTrain": {
    "title": "Kana-Training - Hiragana und Katakana Üben",
    "titleShort": "Kana-Training",
    "description": "Trainieren Sie Ihre Hiragana- und Katakana-Fähigkeiten mit strukturierten Übungseinheiten. Bauen Sie Muskelgedächtnis auf und verbessern Sie die Erkennung.",
    "keywords": "kana training, hiragana übung, katakana übung, strukturiertes lernen"
  },
  "kanjiTrain": {
    "title": "Kanji-Training - Japanische Kanji Üben",
    "titleShort": "Kanji-Training",
    "description": "Trainieren Sie Ihre Kanji-Erkennung und -Schreibung mit strukturierten Übungseinheiten. Meistern Sie japanische Zeichen schrittweise.",
    "keywords": "kanji training, kanji übung, strukturiertes kanji lernen"
  },
  "vocabularyTrain": {
    "title": "Vokabeltraining - Japanische Wörter Üben",
    "titleShort": "Vokabeltraining",
    "description": "Trainieren Sie Ihren japanischen Wortschatz mit strukturierten Übungseinheiten. Lernen und behalten Sie neue Wörter effektiv.",
    "keywords": "vokabeltraining, wort übung, strukturiertes vokabellernen, japanische vokabel übungen"
  },
  "kanaSubset": {
    "hiraganaBase": {
      "title": "Hiragana Grundzeichen (あ-わ) - Grundlegende Hiragana Lernen | KanaDojo",
      "titleShort": "Hiragana Grundzeichen",
      "description": "Meistern Sie die 46 grundlegenden Hiragana-Zeichen (あいうえお, かきくけこ, さしすせそ, etc.). Vollständiger Referenzleitfaden mit Romanisierung für alle fundamentalen japanischen Hiragana.",
      "keywords": "hiragana basis, grundlegende hiragana, hiragana tabelle, あいうえお, hiragana referenz, hiragana grundlagen lernen, japanisches alphabet hiragana, hiragana romanisierung"
    },
    "hiraganaDakuon": {
      "title": "Hiragana Dakuon (が-ぽ) - Stimmhafte Hiragana-Zeichen | KanaDojo",
      "titleShort": "Hiragana Dakuon",
      "description": "Lernen Sie stimmhafte Dakuon- und Handakuon-Hiragana-Zeichen (がぎぐげご, ざじずぜぞ, だぢづでど, ばびぶべぼ, ぱぴぷぺぽ). Meistern Sie alle 25 stimmhaften Hiragana mit Ausspracheführer.",
      "keywords": "hiragana dakuon, stimmhaftes hiragana, hiragana mit dakuten, がぎぐげご, hiragana handakuon, ばびぶべぼ, ぱぴぷぺぽ, stimmhafte hiragana zeichen"
    },
    "hiraganaYoon": {
      "title": "Hiragana Yoon (きゃ-りょ) - Kombinierte Hiragana-Zeichen | KanaDojo",
      "titleShort": "Hiragana Yoon",
      "description": "Meistern Sie kombinierte Yoon-Hiragana-Zeichen (きゃきゅきょ, しゃしゅしょ, ちゃちゅちょ, etc.). Lernen Sie alle 33 kombinierten Hiragana-Laute mit Romanisierung.",
      "keywords": "hiragana yoon, kombiniertes hiragana, hiragana kombinationen, きゃきゅきょ, しゃしゅしょ, ちゃちゅちょ, hiragana digraphen, yoon hiragana"
    },
    "katakanaBase": {
      "title": "Katakana Grundzeichen (ア-ワ) - Grundlegende Katakana Lernen | KanaDojo",
      "titleShort": "Katakana Grundzeichen",
      "description": "Meistern Sie die 46 grundlegenden Katakana-Zeichen (アイウエオ, カキクケコ, サシスセソ, etc.). Vollständiger Referenzleitfaden mit Romanisierung für alle fundamentalen japanischen Katakana.",
      "keywords": "katakana basis, grundlegende katakana, katakana tabelle, アイウエオ, katakana referenz, katakana grundlagen lernen, japanisches alphabet katakana, katakana romanisierung"
    },
    "katakanaDakuon": {
      "title": "Katakana Dakuon (ガ-ポ) - Stimmhafte Katakana-Zeichen | KanaDojo",
      "titleShort": "Katakana Dakuon",
      "description": "Lernen Sie stimmhafte Dakuon- und Handakuon-Katakana-Zeichen (ガギグゲゴ, ザジズゼゾ, ダヂヅデド, バビブベボ, パピプペポ). Meistern Sie alle 25 stimmhaften Katakana mit Ausspracheführer.",
      "keywords": "katakana dakuon, stimmhaftes katakana, katakana mit dakuten, ガギグゲゴ, katakana handakuon, バビブベボ, パピプペポ, stimmhafte katakana zeichen"
    },
    "katakanaYoon": {
      "title": "Katakana Yoon (キャ-リョ) - Kombinierte Katakana-Zeichen | KanaDojo",
      "titleShort": "Katakana Yoon",
      "description": "Meistern Sie kombinierte Yoon-Katakana-Zeichen (キャキュキョ, シャシュショ, チャチュチョ, etc.). Lernen Sie alle 33 kombinierten Katakana-Laute mit Romanisierung.",
      "keywords": "katakana yoon, kombiniertes katakana, katakana kombinationen, キャキュキョ, シャシュショ, チャチュチョ, katakana digraphen, yoon katakana"
    },
    "katakanaForeign": {
      "title": "Katakana Fremdlaute (ファ-ウィ) - Erweitertes Katakana | KanaDojo",
      "titleShort": "Katakana Fremdlaute",
      "description": "Lernen Sie erweiterte Katakana-Zeichen für Fremdwörter (ファ, フィ, ウィ, ウェ, etc.). Meistern Sie spezielle Katakana-Kombinationen im modernen Japanisch.",
      "keywords": "katakana fremdlaute, erweitertes katakana, lehnwörter katakana, ファフィ, ウィウェ, spezielles katakana, modernes katakana, fremdwort katakana"
    }
  }
}
