{
  "categories": [
    {
      "id": "apps",
      "name": "Apps",
      "nameJa": "アプリ",
      "description": "Mobile and desktop applications for learning Japanese",
      "descriptionLong": "Discover the best Japanese learning apps for your smartphone, tablet, and computer. From flashcard apps using spaced repetition to comprehensive learning platforms, these applications make studying Japanese convenient and effective. Whether you're commuting, taking a break, or dedicating time to study, these apps help you learn anytime, anywhere.",
      "icon": "Smartphone",
      "order": 1,
      "subcategories": [
        {
          "id": "flashcards",
          "name": "Flashcard Apps",
          "nameJa": "フラッシュカードアプリ",
          "description": "Spaced repetition and flashcard applications",
          "descriptionLong": "Master Japanese vocabulary and kanji with powerful flashcard apps that use spaced repetition systems (SRS) to optimize your learning. These apps scientifically schedule reviews to help you remember more in less time.",
          "parentCategory": "apps"
        },
        {
          "id": "dictionaries",
          "name": "Dictionary Apps",
          "nameJa": "辞書アプリ",
          "description": "Japanese-English dictionaries and lookup tools",
          "descriptionLong": "Essential dictionary apps for looking up Japanese words, kanji, and phrases. These tools provide detailed definitions, example sentences, and pronunciation guides to support your Japanese studies.",
          "parentCategory": "apps"
        },
        {
          "id": "comprehensive",
          "name": "Comprehensive Learning",
          "nameJa": "総合学習アプリ",
          "description": "All-in-one Japanese learning platforms",
          "descriptionLong": "Complete Japanese learning platforms that cover multiple aspects of the language including vocabulary, grammar, reading, and listening. These apps provide structured courses and track your progress.",
          "parentCategory": "apps"
        },
        {
          "id": "input-methods",
          "name": "Input Methods",
          "nameJa": "入力方法",
          "description": "Japanese keyboard and input tools",
          "descriptionLong": "Japanese keyboard apps and input method editors (IME) that let you type in Japanese on any device. Essential tools for practicing writing and communicating in Japanese.",
          "parentCategory": "apps"
        }
      ]
    },
    {
      "id": "websites",
      "name": "Websites",
      "nameJa": "ウェブサイト",
      "description": "Online resources and learning platforms",
      "descriptionLong": "Explore the best websites for learning Japanese online. From interactive courses to reference materials, these web-based resources offer flexible learning options accessible from any browser. Many are free and provide high-quality content for learners at all levels.",
      "icon": "Globe",
      "order": 2,
      "subcategories": [
        {
          "id": "courses",
          "name": "Online Courses",
          "nameJa": "オンラインコース",
          "description": "Structured online Japanese courses",
          "descriptionLong": "Structured online courses that guide you through Japanese from beginner to advanced levels. These platforms offer lessons, exercises, and progress tracking to keep you on track.",
          "parentCategory": "websites"
        },
        {
          "id": "reference",
          "name": "Reference Sites",
          "nameJa": "参考サイト",
          "description": "Grammar guides and reference materials",
          "descriptionLong": "Comprehensive reference websites for Japanese grammar, vocabulary, and language rules. Bookmark these sites for quick lookups and in-depth explanations.",
          "parentCategory": "websites"
        },
        {
          "id": "practice",
          "name": "Practice Sites",
          "nameJa": "練習サイト",
          "description": "Interactive practice and exercises",
          "descriptionLong": "Interactive websites where you can practice Japanese through exercises, quizzes, and games. Perfect for reinforcing what you've learned and testing your knowledge.",
          "parentCategory": "websites"
        }
      ]
    },
    {
      "id": "textbooks",
      "name": "Textbooks",
      "nameJa": "教科書",
      "description": "Physical and digital textbooks for structured learning",
      "descriptionLong": "The most recommended Japanese textbooks used by students and teachers worldwide. These carefully structured learning materials provide comprehensive coverage of grammar, vocabulary, reading, and writing. From popular series like Genki and Minna no Nihongo to specialized resources, find the perfect textbook for your learning journey.",
      "icon": "BookOpen",
      "order": 3,
      "subcategories": [
        {
          "id": "beginner",
          "name": "Beginner Textbooks",
          "nameJa": "初級教科書",
          "description": "Textbooks for Japanese beginners",
          "descriptionLong": "Start your Japanese journey with these beginner-friendly textbooks. Designed for learners with little to no prior knowledge, these books introduce hiragana, katakana, basic grammar, and essential vocabulary.",
          "parentCategory": "textbooks"
        },
        {
          "id": "intermediate",
          "name": "Intermediate Textbooks",
          "nameJa": "中級教科書",
          "description": "Textbooks for intermediate learners",
          "descriptionLong": "Take your Japanese to the next level with intermediate textbooks. These materials build on foundational knowledge and introduce more complex grammar patterns, kanji, and vocabulary.",
          "parentCategory": "textbooks"
        },
        {
          "id": "advanced",
          "name": "Advanced Textbooks",
          "nameJa": "上級教科書",
          "description": "Textbooks for advanced learners",
          "descriptionLong": "Challenge yourself with advanced Japanese textbooks. These resources cover sophisticated grammar, nuanced vocabulary, and prepare you for native-level content.",
          "parentCategory": "textbooks"
        },
        {
          "id": "specialized",
          "name": "Specialized Books",
          "nameJa": "専門書",
          "description": "Books focusing on specific skills",
          "descriptionLong": "Specialized Japanese learning books that focus on specific areas like kanji, grammar, reading comprehension, or business Japanese. Perfect for targeted study.",
          "parentCategory": "textbooks"
        }
      ]
    },
    {
      "id": "youtube",
      "name": "YouTube Channels",
      "nameJa": "YouTubeチャンネル",
      "description": "Video content creators teaching Japanese",
      "descriptionLong": "Learn Japanese through engaging video content from talented educators on YouTube. These channels offer free lessons covering everything from basic phrases to advanced grammar, cultural insights, and real-world Japanese usage. Visual learning combined with native speaker pronunciation makes YouTube an invaluable resource.",
      "icon": "Youtube",
      "order": 4,
      "subcategories": [
        {
          "id": "lessons",
          "name": "Lesson Channels",
          "nameJa": "レッスンチャンネル",
          "description": "Structured Japanese lessons",
          "descriptionLong": "YouTube channels offering structured Japanese lessons from beginner to advanced levels. Learn grammar, vocabulary, and pronunciation through well-organized video series.",
          "parentCategory": "youtube"
        },
        {
          "id": "culture",
          "name": "Culture & Language",
          "nameJa": "文化と言語",
          "description": "Japanese culture and language insights",
          "descriptionLong": "Channels that combine Japanese language learning with cultural insights. Understand the context behind the language and learn how Japanese is used in real-life situations.",
          "parentCategory": "youtube"
        },
        {
          "id": "entertainment",
          "name": "Entertainment Learning",
          "nameJa": "エンタメ学習",
          "description": "Learn through entertainment content",
          "descriptionLong": "Fun and entertaining YouTube channels that make learning Japanese enjoyable. Learn through vlogs, challenges, and engaging content while picking up natural Japanese.",
          "parentCategory": "youtube"
        }
      ]
    },
    {
      "id": "podcasts",
      "name": "Podcasts",
      "nameJa": "ポッドキャスト",
      "description": "Audio content for listening practice",
      "descriptionLong": "Improve your Japanese listening skills with podcasts designed for learners. From beginner-friendly shows with slow, clear speech to advanced content featuring natural conversations, podcasts are perfect for learning on the go. Listen during your commute, workout, or anytime you want to immerse yourself in Japanese.",
      "icon": "Headphones",
      "order": 5,
      "subcategories": [
        {
          "id": "beginner-podcasts",
          "name": "Beginner Podcasts",
          "nameJa": "初級ポッドキャスト",
          "description": "Podcasts for Japanese beginners",
          "descriptionLong": "Podcasts designed for Japanese beginners with slow, clear speech and explanations. Perfect for developing your listening skills from the ground up.",
          "parentCategory": "podcasts"
        },
        {
          "id": "intermediate-podcasts",
          "name": "Intermediate Podcasts",
          "nameJa": "中級ポッドキャスト",
          "description": "Podcasts for intermediate learners",
          "descriptionLong": "Podcasts for intermediate Japanese learners featuring more natural speech patterns and diverse topics. Bridge the gap between textbook Japanese and real-world usage.",
          "parentCategory": "podcasts"
        },
        {
          "id": "native-content",
          "name": "Native Content",
          "nameJa": "ネイティブコンテンツ",
          "description": "Podcasts made for native speakers",
          "descriptionLong": "Japanese podcasts made for native speakers. Challenge yourself with authentic content covering news, entertainment, and various topics.",
          "parentCategory": "podcasts"
        }
      ]
    },
    {
      "id": "games",
      "name": "Video Games",
      "nameJa": "ビデオゲーム",
      "description": "Learn Japanese through gaming",
      "descriptionLong": "Level up your Japanese skills by playing video games in Japanese. Gaming provides an immersive, engaging way to learn vocabulary, reading comprehension, and natural language patterns. From text-heavy RPGs to visual novels, discover games that make learning feel like play.",
      "icon": "Gamepad2",
      "order": 6,
      "subcategories": [
        {
          "id": "rpg",
          "name": "RPGs",
          "nameJa": "RPG",
          "description": "Role-playing games with Japanese text",
          "descriptionLong": "Japanese role-playing games (JRPGs) offer extensive reading practice through dialogue, menus, and story content. Immerse yourself in epic adventures while building vocabulary.",
          "parentCategory": "games"
        },
        {
          "id": "visual-novels",
          "name": "Visual Novels",
          "nameJa": "ビジュアルノベル",
          "description": "Story-driven visual novels",
          "descriptionLong": "Visual novels are perfect for Japanese reading practice with their text-heavy format and engaging stories. Many include voice acting for listening practice too.",
          "parentCategory": "games"
        },
        {
          "id": "educational-games",
          "name": "Educational Games",
          "nameJa": "教育ゲーム",
          "description": "Games designed for learning",
          "descriptionLong": "Games specifically designed to teach Japanese through gameplay. Learn vocabulary, kanji, and grammar while having fun with game mechanics.",
          "parentCategory": "games"
        },
        {
          "id": "casual-games",
          "name": "Casual Games",
          "nameJa": "カジュアルゲーム",
          "description": "Casual games playable in Japanese",
          "descriptionLong": "Casual and mobile games that can be played in Japanese. Great for short study sessions and picking up everyday vocabulary.",
          "parentCategory": "games"
        }
      ]
    },
    {
      "id": "jlpt",
      "name": "JLPT Preparation",
      "nameJa": "JLPT対策",
      "description": "Resources for JLPT exam preparation",
      "descriptionLong": "Prepare for the Japanese Language Proficiency Test (JLPT) with targeted study materials. From N5 to N1, find practice tests, vocabulary lists, grammar guides, and study strategies to help you pass your target level. The JLPT is the most widely recognized Japanese proficiency certification worldwide.",
      "icon": "GraduationCap",
      "order": 7,
      "subcategories": [
        {
          "id": "n5",
          "name": "JLPT N5",
          "nameJa": "JLPT N5",
          "description": "N5 level preparation materials",
          "descriptionLong": "Study materials for JLPT N5, the entry-level certification. Master basic hiragana, katakana, essential kanji, and foundational grammar to pass this first milestone.",
          "parentCategory": "jlpt"
        },
        {
          "id": "n4",
          "name": "JLPT N4",
          "nameJa": "JLPT N4",
          "description": "N4 level preparation materials",
          "descriptionLong": "Resources for JLPT N4 preparation. Build on N5 knowledge with more kanji, vocabulary, and grammar patterns needed for basic conversations.",
          "parentCategory": "jlpt"
        },
        {
          "id": "n3",
          "name": "JLPT N3",
          "nameJa": "JLPT N3",
          "description": "N3 level preparation materials",
          "descriptionLong": "JLPT N3 study materials for intermediate learners. This level bridges basic and advanced Japanese, requiring solid grammar and vocabulary knowledge.",
          "parentCategory": "jlpt"
        },
        {
          "id": "n2",
          "name": "JLPT N2",
          "nameJa": "JLPT N2",
          "description": "N2 level preparation materials",
          "descriptionLong": "Advanced preparation materials for JLPT N2. This level demonstrates ability to understand Japanese in everyday situations and is often required for work in Japan.",
          "parentCategory": "jlpt"
        },
        {
          "id": "n1",
          "name": "JLPT N1",
          "nameJa": "JLPT N1",
          "description": "N1 level preparation materials",
          "descriptionLong": "The highest level of JLPT certification. N1 materials cover advanced grammar, extensive vocabulary, and complex reading comprehension for near-native proficiency.",
          "parentCategory": "jlpt"
        }
      ]
    },
    {
      "id": "reading",
      "name": "Reading",
      "nameJa": "読解",
      "description": "Resources for improving reading skills",
      "descriptionLong": "Develop your Japanese reading skills with graded readers, news sites, and native content. Reading is essential for expanding vocabulary, understanding grammar in context, and preparing for real-world Japanese. Start with materials at your level and gradually challenge yourself with more complex texts.",
      "icon": "BookText",
      "order": 8,
      "subcategories": [
        {
          "id": "graded-readers",
          "name": "Graded Readers",
          "nameJa": "レベル別読み物",
          "description": "Level-appropriate reading materials",
          "descriptionLong": "Graded readers designed for Japanese learners at specific levels. These books use controlled vocabulary and grammar to provide comprehensible reading practice.",
          "parentCategory": "reading"
        },
        {
          "id": "news",
          "name": "News Sites",
          "nameJa": "ニュースサイト",
          "description": "Japanese news for learners",
          "descriptionLong": "Japanese news websites and apps, including those designed for learners with simplified language. Stay informed while practicing reading real-world content.",
          "parentCategory": "reading"
        },
        {
          "id": "manga",
          "name": "Manga",
          "nameJa": "漫画",
          "description": "Japanese comics for reading practice",
          "descriptionLong": "Learn Japanese through manga! Comics provide visual context that aids comprehension and expose you to casual, conversational Japanese.",
          "parentCategory": "reading"
        },
        {
          "id": "novels",
          "name": "Novels & Literature",
          "nameJa": "小説・文学",
          "description": "Japanese novels and literature",
          "descriptionLong": "Japanese novels and literature for advanced reading practice. Challenge yourself with authentic Japanese writing and expand your vocabulary.",
          "parentCategory": "reading"
        }
      ]
    },
    {
      "id": "listening",
      "name": "Listening",
      "nameJa": "リスニング",
      "description": "Resources for improving listening comprehension",
      "descriptionLong": "Train your ears to understand spoken Japanese with dedicated listening resources. From slow, clear audio for beginners to natural-speed conversations for advanced learners, consistent listening practice is key to comprehension. These resources help you understand different accents, speech patterns, and real-world Japanese.",
      "icon": "Ear",
      "order": 9,
      "subcategories": [
        {
          "id": "audio-lessons",
          "name": "Audio Lessons",
          "nameJa": "音声レッスン",
          "description": "Structured audio learning materials",
          "descriptionLong": "Audio lessons designed specifically for Japanese learners. These structured materials help you develop listening skills progressively.",
          "parentCategory": "listening"
        },
        {
          "id": "shadowing",
          "name": "Shadowing Resources",
          "nameJa": "シャドーイング教材",
          "description": "Materials for shadowing practice",
          "descriptionLong": "Resources for shadowing practice, a technique where you repeat audio immediately after hearing it. Excellent for improving pronunciation and listening simultaneously.",
          "parentCategory": "listening"
        },
        {
          "id": "comprehension",
          "name": "Comprehension Practice",
          "nameJa": "聴解練習",
          "description": "Listening comprehension exercises",
          "descriptionLong": "Listening comprehension exercises and tests to measure and improve your understanding of spoken Japanese.",
          "parentCategory": "listening"
        }
      ]
    },
    {
      "id": "speaking",
      "name": "Speaking",
      "nameJa": "スピーキング",
      "description": "Resources for improving speaking skills",
      "descriptionLong": "Build confidence in speaking Japanese with resources focused on pronunciation, conversation practice, and output skills. Speaking is often the most challenging skill to develop, but these tools and platforms provide opportunities to practice with native speakers and AI tutors.",
      "icon": "MessageCircle",
      "order": 10,
      "subcategories": [
        {
          "id": "pronunciation",
          "name": "Pronunciation",
          "nameJa": "発音",
          "description": "Pronunciation guides and tools",
          "descriptionLong": "Master Japanese pronunciation with guides, tools, and exercises. Learn proper pitch accent, vowel sounds, and natural rhythm.",
          "parentCategory": "speaking"
        },
        {
          "id": "conversation",
          "name": "Conversation Practice",
          "nameJa": "会話練習",
          "description": "Platforms for conversation practice",
          "descriptionLong": "Platforms and tools for practicing Japanese conversation. Connect with native speakers, tutors, or AI partners to improve your speaking skills.",
          "parentCategory": "speaking"
        },
        {
          "id": "tutoring",
          "name": "Online Tutoring",
          "nameJa": "オンライン家庭教師",
          "description": "One-on-one tutoring platforms",
          "descriptionLong": "Online tutoring platforms where you can book lessons with Japanese teachers. Get personalized feedback and structured conversation practice.",
          "parentCategory": "speaking"
        }
      ]
    },
    {
      "id": "writing",
      "name": "Writing",
      "nameJa": "ライティング",
      "description": "Resources for improving writing skills",
      "descriptionLong": "Develop your Japanese writing skills from basic character writing to composing essays. Writing reinforces vocabulary and grammar while helping you express yourself in Japanese. These resources cover handwriting practice, typing, and getting feedback on your written Japanese.",
      "icon": "PenTool",
      "order": 11,
      "subcategories": [
        {
          "id": "handwriting",
          "name": "Handwriting Practice",
          "nameJa": "手書き練習",
          "description": "Tools for practicing handwriting",
          "descriptionLong": "Practice writing Japanese characters by hand with stroke order guides, worksheets, and apps. Proper handwriting helps with character recognition and memory.",
          "parentCategory": "writing"
        },
        {
          "id": "composition",
          "name": "Composition",
          "nameJa": "作文",
          "description": "Writing and composition practice",
          "descriptionLong": "Resources for practicing Japanese composition, from simple sentences to essays. Learn to express your thoughts clearly in written Japanese.",
          "parentCategory": "writing"
        },
        {
          "id": "correction",
          "name": "Writing Correction",
          "nameJa": "添削",
          "description": "Platforms for getting writing feedback",
          "descriptionLong": "Platforms where native speakers correct your Japanese writing. Get feedback on grammar, word choice, and natural expression.",
          "parentCategory": "writing"
        }
      ]
    },
    {
      "id": "grammar",
      "name": "Grammar",
      "nameJa": "文法",
      "description": "Grammar guides and learning resources",
      "descriptionLong": "Master Japanese grammar with comprehensive guides, explanations, and practice exercises. Understanding grammar is essential for constructing sentences and comprehending Japanese. From basic particles to complex sentence patterns, these resources break down Japanese grammar into digestible lessons.",
      "icon": "FileText",
      "order": 12,
      "subcategories": [
        {
          "id": "guides",
          "name": "Grammar Guides",
          "nameJa": "文法ガイド",
          "description": "Comprehensive grammar explanations",
          "descriptionLong": "Detailed grammar guides that explain Japanese sentence structures, particles, verb conjugations, and more. Essential references for understanding how Japanese works.",
          "parentCategory": "grammar"
        },
        {
          "id": "practice-grammar",
          "name": "Grammar Practice",
          "nameJa": "文法練習",
          "description": "Interactive grammar exercises",
          "descriptionLong": "Interactive exercises and drills for practicing Japanese grammar. Reinforce your understanding through active practice.",
          "parentCategory": "grammar"
        },
        {
          "id": "sentence-patterns",
          "name": "Sentence Patterns",
          "nameJa": "文型",
          "description": "Common sentence pattern resources",
          "descriptionLong": "Resources focused on Japanese sentence patterns and structures. Learn how to construct various types of sentences naturally.",
          "parentCategory": "grammar"
        }
      ]
    },
    {
      "id": "vocabulary",
      "name": "Vocabulary",
      "nameJa": "語彙",
      "description": "Vocabulary building resources",
      "descriptionLong": "Expand your Japanese vocabulary with targeted learning resources. A strong vocabulary is the foundation of language proficiency. These resources help you learn words efficiently through frequency lists, themed collections, and spaced repetition systems.",
      "icon": "Library",
      "order": 13,
      "subcategories": [
        {
          "id": "frequency-lists",
          "name": "Frequency Lists",
          "nameJa": "頻度リスト",
          "description": "Most common words lists",
          "descriptionLong": "Learn the most frequently used Japanese words first. Frequency-based vocabulary lists help you prioritize the words that matter most.",
          "parentCategory": "vocabulary"
        },
        {
          "id": "themed-vocab",
          "name": "Themed Vocabulary",
          "nameJa": "テーマ別語彙",
          "description": "Vocabulary organized by topic",
          "descriptionLong": "Vocabulary resources organized by themes like travel, food, business, and more. Learn words relevant to your interests and needs.",
          "parentCategory": "vocabulary"
        },
        {
          "id": "word-lists",
          "name": "Word Lists & Decks",
          "nameJa": "単語リスト",
          "description": "Pre-made vocabulary lists and flashcard decks",
          "descriptionLong": "Ready-to-use vocabulary lists and flashcard decks for various levels and purposes. Save time with curated word collections.",
          "parentCategory": "vocabulary"
        }
      ]
    },
    {
      "id": "kanji",
      "name": "Kanji",
      "nameJa": "漢字",
      "description": "Kanji learning resources",
      "descriptionLong": "Conquer Japanese kanji with specialized learning resources. Kanji is often considered the biggest challenge in learning Japanese, but with the right approach and tools, you can systematically learn thousands of characters. These resources offer various methods from traditional to modern mnemonic approaches.",
      "icon": "Languages",
      "order": 14,
      "subcategories": [
        {
          "id": "learning-systems",
          "name": "Learning Systems",
          "nameJa": "学習システム",
          "description": "Systematic kanji learning methods",
          "descriptionLong": "Structured systems for learning kanji, including mnemonic methods, radical-based approaches, and frequency-based curricula.",
          "parentCategory": "kanji"
        },
        {
          "id": "kanji-practice",
          "name": "Kanji Practice",
          "nameJa": "漢字練習",
          "description": "Kanji writing and recognition practice",
          "descriptionLong": "Tools and resources for practicing kanji writing, recognition, and readings. Regular practice is key to kanji mastery.",
          "parentCategory": "kanji"
        },
        {
          "id": "kanji-reference",
          "name": "Kanji Reference",
          "nameJa": "漢字辞典",
          "description": "Kanji dictionaries and lookup tools",
          "descriptionLong": "Kanji dictionaries and reference tools for looking up characters, meanings, readings, and stroke orders.",
          "parentCategory": "kanji"
        }
      ]
    },
    {
      "id": "immersion",
      "name": "Immersion",
      "nameJa": "イマージョン",
      "description": "Tools and content for Japanese immersion",
      "descriptionLong": "Immerse yourself in Japanese with tools and content designed for language acquisition through exposure. Immersion learning complements structured study by exposing you to natural Japanese in context. These resources help you consume Japanese media, understand native content, and create an immersive environment.",
      "icon": "Waves",
      "order": 15,
      "subcategories": [
        {
          "id": "media-tools",
          "name": "Media Tools",
          "nameJa": "メディアツール",
          "description": "Tools for consuming Japanese media",
          "descriptionLong": "Browser extensions, apps, and tools that help you learn from Japanese media. Add subtitles, look up words, and track your immersion time.",
          "parentCategory": "immersion"
        },
        {
          "id": "streaming",
          "name": "Streaming Services",
          "nameJa": "ストリーミング",
          "description": "Japanese content streaming platforms",
          "descriptionLong": "Streaming platforms with Japanese content including anime, dramas, movies, and variety shows. Watch with Japanese subtitles for maximum learning benefit.",
          "parentCategory": "immersion"
        },
        {
          "id": "sentence-mining",
          "name": "Sentence Mining",
          "nameJa": "例文収集",
          "description": "Tools for sentence mining and Anki",
          "descriptionLong": "Tools and workflows for sentence mining - extracting sentences from native content to create personalized flashcards and vocabulary lists.",
          "parentCategory": "immersion"
        }
      ]
    },
    {
      "id": "community",
      "name": "Community",
      "nameJa": "コミュニティ",
      "description": "Japanese learning communities and forums",
      "descriptionLong": "Connect with fellow Japanese learners and native speakers in online communities. Learning a language is more enjoyable and effective with support from others. These communities offer places to ask questions, share resources, find study partners, and stay motivated on your Japanese learning journey.",
      "icon": "Users",
      "order": 16,
      "subcategories": [
        {
          "id": "forums",
          "name": "Forums & Discussion",
          "nameJa": "フォーラム",
          "description": "Online forums for Japanese learners",
          "descriptionLong": "Online forums and discussion boards where Japanese learners gather to ask questions, share tips, and discuss their learning journey.",
          "parentCategory": "community"
        },
        {
          "id": "discord",
          "name": "Discord Servers",
          "nameJa": "Discordサーバー",
          "description": "Discord communities for Japanese learning",
          "descriptionLong": "Active Discord servers dedicated to Japanese learning. Chat with other learners, join study sessions, and practice with native speakers.",
          "parentCategory": "community"
        },
        {
          "id": "language-exchange",
          "name": "Language Exchange",
          "nameJa": "言語交換",
          "description": "Platforms for language exchange",
          "descriptionLong": "Language exchange platforms where you can practice Japanese with native speakers who want to learn your language. Mutual learning benefits both parties.",
          "parentCategory": "community"
        }
      ]
    }
  ]
}
